RotatingBoundaryConditions_RBC/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1.46E-07 0 0);

boundaryField
{
    inlet 
    {
        type            fixedValue;
	value		$internalField;
    }

    outlet
    {
        type            zeroGradient;
    }

    rotWall
    {
	type		rotatingWallVelocity;
	origin		(0 0 0);
	axis		(0 0 1);
	omega		0;
	//value		uniform (6 0 0);
    }
    
    "(lower_wall|upper_wall)"
    {
    	type 		slip;
    }

    frontAndBackPlanes
    {
        type            empty;
    }
}

// ************************************************************************* //
